<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"57998e8a1326e0f26d6e3450c9f7eb7774ae80ec42b831d27a736bead0c84b0d","plan_job_ref":"Job Environment Main - Plan #416 at https://github.com/jarrod-lowe/wildsea/actions/runs/11411972737","plan_out_hash":"31b811bba98539c1767647961a75872d0921dae80fd7d1999f80c295d2fc0cbb","plan_hash":"986b78632dde7edee4b6944699d2e974dbca1eda9f42b41036b67b5a1148bbda","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_function.function["createShip"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/createShip/createShip.ts
            import {
              util
            } from "@aws-appsync/utils";
            
            // lib/constants.ts
            var TypeShip = "SHIP";
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
            // function/createShip/createShip.ts
            function request(context) {
              const input = context.arguments.input;
              const id = util.autoId();
              const timestamp = util.time.nowISO8601();
              return {
                operation: "PutItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixPlayer + "#" + id
                }),
                attributeValues: util.dynamodb.toMapValues({
                  gameId: input.gameId,
                  userId: id,
                  gameName: context.prev.result.gameName,
                  gameDescription: context.prev.result.gameDescription,
                  characterName: input.characterName,
                  fireflyUserId: context.prev.result.fireflyUserId,
                  createdAt: timestamp,
                  updatedAt: timestamp,
                  type: TypeShip
                })
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiY3JlYXRlU2hpcC50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBO0FBQUEsRUFDRTtBQUFBLE9BSUs7OztBQ0RBLElBQU0sV0FBVztBQUVqQixJQUFNLGdCQUFnQjtBQUV0QixJQUFNLGtCQUFrQjs7O0FESXhCLFNBQVMsUUFDZCxTQUN3QjtBQUN4QixRQUFNLFFBQVEsUUFBUSxVQUFVO0FBQ2hDLFFBQU0sS0FBSyxLQUFLLE9BQU87QUFDdkIsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGtCQUFrQixNQUFNO0FBQUEsSUFDOUIsQ0FBQztBQUFBLElBQ0QsaUJBQWlCLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDekMsUUFBUSxNQUFNO0FBQUEsTUFDZCxRQUFRO0FBQUEsTUFDUixVQUFVLFFBQVEsS0FBSyxPQUFPO0FBQUEsTUFDOUIsaUJBQWlCLFFBQVEsS0FBSyxPQUFPO0FBQUEsTUFDckMsZUFBZSxNQUFNO0FBQUEsTUFDckIsZUFBZSxRQUFRLEtBQUssT0FBTztBQUFBLE1BQ25DLFdBQVc7QUFBQSxNQUNYLFdBQVc7QUFBQSxNQUNYLE1BQU07QUFBQSxJQUNSLENBQW9CO0FBQUEsRUFDdEI7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUFzQztBQUM3RCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "createShip"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                   = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                 = "Wildsea-primary"
!~      schema               = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools
                joinGame(input: JoinGameInput!): GameSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
          +     createShip(input: CreateShipInput!): PlayerSheetSummary! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(input: GetGameInput): Game! @aws_cognito_user_pools
                getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
          -   updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer"])
          +   updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createShip"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "joinGame", "deleteGame"])
            }
            
            input GetGameInput {
              gameId: ID!
            }
            
            input CreateGameInput {
                name: String!
                description: String
            }
            
            input JoinGameInput {
              gameId: ID!
              joinToken: ID!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinToken: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
          + input CreateShipInput {
          +   gameId: ID!
          +   characterName: String!
          + }
          + 
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameDescription: String!
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              fireflyUserId: ID!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
        EOT
        tags                 = {
            "Name" = "Wildsea-primary"
        }
#        (9 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.pipeline["createShip"] will be created
+   resource "aws_appsync_resolver" "pipeline" {
+       api_id            = "**************************"
+       arn               = (known after apply)
+       field             = "createShip"
+       id                = (known after apply)
+       kind              = "PIPELINE"
+       request_template  = jsonencode({})
+       response_template = "$util.toJson($ctx.result)"
+       type              = "Mutation"

+       pipeline_config {
+           functions = (known after apply)
        }
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #416](https://github.com/jarrod-lowe/wildsea/actions/runs/11411972737)